# PointsOnSegments

# Ввод координат точек A1, A2, A3, A4
A1 = int(input('Введите координату точки A1: '))
A2 = int(input('Введите координату точки A2: '))
A3 = int(input('Введите координату точки A3: '))
A4 = int(input('Введите координату точки A4: '))

# Ввод количества дополнительных точек
N = int(input('Введите количество дополнительных точек: '))

# Ввод координат дополнительных точек
X = []
for i in range(1, N + 1):
    X.append(int(input(f'Введите координату точки {i}: ')))

# Инициализация счетчиков точек на отрезках
Count = [0] * 4

# Подсчет количества точек на каждом отрезке
for i in range(N):
    if A1 < X[i] <= A2:
        Count[0] += 1
    if A2 < X[i] <= A3:
        Count[1] += 1
    if A3 < X[i] <= A4:
        Count[2] += 1
    if X[i] > A4:
        Count[3] += 1

# Вывод результатов
print('Количество точек на отрезке [A1, A2]:', Count[0])
print('Количество точек на отрезке [A2, A3]:', Count[1])
print('Количество точек на отрезке [A3, A4]:', Count[2])
print('Количество точек на отрезке [A4, +oo):', Count[3])